# identity-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.data.aws_cognito_user_pools.user_pool: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=kcsvs70msd]
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/identity_api]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.lambda_role: Refreshing state... [id=le-identity_api]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=2b72ed34-0e44-45a4-ba94-0e5251591de4:identity_api]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 0s [id=upstash_kafka_cluster_credential_id]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Read complete after 0s [id=production]
module.common_resources.data.curl.cognito_user_pool_keys: Reading...
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=le-identity_api-20230527063701157500000001]
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/identity_api]
module.common_resources.data.curl.cognito_user_pool_keys: Read complete after 0s [id=1685178340]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 0s [id=upstash-kafka-credential-6514be35-6c9d-45cc-bfd5-d4ff953b6cc3]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-71cc196e-357d-414a-ac72-a27674097bd5]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 2s [id=3ba5dd43c294aa1809d57ffd5ab7f45aaf601619]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=identity_api]
module.common_resources.module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=nnjbs2a]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any["all"]: Refreshing state... [id=rv4etcb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "identity_api"
      ~ last_modified                  = "2023-05-27T06:37:18.173+0000" -> (known after apply)
      ~ source_code_hash               = "q8XHBaCtSqxGbFLxCwkbttOXF6gsnumFANN1TWNyYfQ=" -> "pz/LZVVb6KIVwOzpwgclg2XKICSQFFkIOGEm/nd4nm8="
        tags                           = {
            "domain"        = "identity"
            "environment"   = "production"
            "resource"      = "identity-api"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS"                           = "sharing-tortoise-8552-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"                                 = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"                                  = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"                                    = "dcb14a7f24bc4f7992bbe541919e020c"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"                              = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"                                    = "c2hhcmluZy10b3J0b2lzZS04NTUyJHVJ3ozhIEgLwBeQ1A2M5r7T00NFZXw8uXo"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"                                 = (sensitive value)
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_DEFAULT_KEYS"             = jsonencode(
                    {
                      - keys = [
                          - {
                              - alg = "RS256"
                              - e   = "AQAB"
                              - kid = "i7CIPqFmbfruZASEPT3sj97ofsW9YwB+MQ83bSUMOPM="
                              - kty = "RSA"
                              - n   = "32a-nBo-Zlu7ltZ8xxUqMB4D6AMELhPw2jaV8oJlYz60ND1kzlG3WoArlqfqD-culWwK5nObNh8h2ak0dZ8baAwPskuG_TLzGdqo8APKpjnwxtSBRNhQuOqsDqRSybcz18ScoO2HAJM3oPb4sqkchgO4JMElVWM7_tHSP9lmn8aXH_S_NCSByHFK2RAuA96q8kuXFS1w4v3UCigBgqrQGcbhA2taHRBl60Tq4n_Lkq44OjiqSdb7bAewG-5SmnMv4KDfOPQdknxYoNX83yEbzpGn8TYv1tOXKsKh6PaLWELmIq2fs4sch3h8EvKrnwjLBhCi-GWCRRfDgHrmwj9Xsw"
                              - use = "sig"
                            },
                          - {
                              - alg = "RS256"
                              - e   = "AQAB"
                              - kid = "4mZMw8M5ojixh3NtxUVUu++PH72hCSaCGcdUvhpCjw8="
                              - kty = "RSA"
                              - n   = "wo6Dtc2DiG9QAo9hzKQ6LTSCPa6eSjgnepjATPRDDdIcYjobhFy1ZVgUZXCPMRjwkW82NkQQiPTeznd1UZhBl7E2esMxKWklZXtjZ8WtMdhPxJftU1rdcGep_67qn0XjIit6bPRNID0GoWI63dR1no9qM2hMa7D_ekX2KScQGu-RQnd_JpOyJJ1JblvAfbSKIzY7Ih0nKENZrb_3HFQByvlD564UqS5DSDFiQKVXQcQGt-zOAw7VHyXsnqkEPFD65lDxvPjLi6UP4M6u8FSYtqBRQonWe3D-wW7orKw86QnlueJDCU4tUzX_aO3SRHV07KlHjUE6X_cOMnXAPnJnhQ"
                              - use = "sig"
                            },
                        ]
                    }
                )
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_DEFAULT_REFRESH_RSA_KEYS" = "false"
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_URL"                      = "https://cognito-idp.us-east-1.amazonaws.com/us-east-1_8XHxrfabm/.well-known/jwks.json"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "identity"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "identity_api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "2b72ed34-0e44-45a4-ba94-0e5251591de4:identity_api"
        name       = "identity_api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "c570db67-e896-427e-8810-9d313f7b546a" -> "c3e6fbe1-fb70-49e2-bd20-e423dd822691"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*